// select elements
let htmlJson = {
  kind: "youtube#playlistItemListResponse",
  etag: "WwSRuBxCUMt4YpKvbgOnyOfg2eM",
  items: [
    {
      kind: "youtube#playlistItem",
      etag: "rYiuqvJ_OywSE7tsH-UHCJlaKDk",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay41NkI0NEY2RDEwNTU3Q0M2",
      snippet: {
        publishedAt: "2020-11-18T01:00:25Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "1 bootstrap 2021 tutorial | كورس بوتستراب بالعربي",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/R50HZWpwsos/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/R50HZWpwsos/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/R50HZWpwsos/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/R50HZWpwsos/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/R50HZWpwsos/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 0,
        resourceId: {
          kind: "youtube#video",
          videoId: "R50HZWpwsos",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "yXoW1_xw3KQmRNRXMCQcwln9QC0",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4yODlGNEE0NkRGMEEzMEQy",
      snippet: {
        publishedAt: "2020-11-19T06:03:53Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "2 bootstrap tutorial | تهيئة العمل بالكامل للبوتستراب تحميل البوتستراب و الجيكويري و البوبر",
        description:
          "روابط :\n________________________\n\n\nرابط تحميل البوتستراب\nhttps://getbootstrap.com/docs/4.0/getting-started/download/\n\n\nرابط تحميل ملف jquery\nhttps://jquery.com/download/\n\n\nرابط تحميل ملف popper.min.js\nhttps://cdnjs.cloudflare.com/ajax/libs/popper.js/1.11.0/umd/popper.min.js\n\n\nرابط الاكواد الجاهزة للبوتستراب\nhttps://getbootstrap.com/docs/4.5/getting-started/introduction/\n________________________\n\n\nما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\n\n \n\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\n\n \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/4yWf4jwMA7Y/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/4yWf4jwMA7Y/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/4yWf4jwMA7Y/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/4yWf4jwMA7Y/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/4yWf4jwMA7Y/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 1,
        resourceId: {
          kind: "youtube#video",
          videoId: "4yWf4jwMA7Y",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "NEoYXUJLH5dTtBXdp13_bKTkNSg",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4wMTcyMDhGQUE4NTIzM0Y5",
      snippet: {
        publishedAt: "2020-11-19T07:11:04Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "3 bootstrap tutorial | نظام grid system in bootstrap",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/itMuex4BfS8/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/itMuex4BfS8/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/itMuex4BfS8/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/itMuex4BfS8/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/itMuex4BfS8/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 2,
        resourceId: {
          kind: "youtube#video",
          videoId: "itMuex4BfS8",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "GBqMShMww2n5rh5Ik9_6PkkQkHo",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay41MjE1MkI0OTQ2QzJGNzNG",
      snippet: {
        publishedAt: "2020-11-19T07:20:06Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "4 bootstrap tutorial | الصفوف و الاعمدة على مقاسات الشاشة المختلفة",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/ZC_IWh-5EoM/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/ZC_IWh-5EoM/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/ZC_IWh-5EoM/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/ZC_IWh-5EoM/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/ZC_IWh-5EoM/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 3,
        resourceId: {
          kind: "youtube#video",
          videoId: "ZC_IWh-5EoM",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "M8WW4MXDuiCfcNiInTyRDHOtgmk",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4wOTA3OTZBNzVEMTUzOTMy",
      snippet: {
        publishedAt: "2020-11-19T07:23:59Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "5 bootstrap tutorial |  justify content and align items in grid system",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/BWEjUOy-4gE/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/BWEjUOy-4gE/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/BWEjUOy-4gE/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/BWEjUOy-4gE/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/BWEjUOy-4gE/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 4,
        resourceId: {
          kind: "youtube#video",
          videoId: "BWEjUOy-4gE",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "6mdqaPJMvBTZ6AeWb31EjxESlLA",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4xMkVGQjNCMUM1N0RFNEUx",
      snippet: {
        publishedAt: "2020-11-19T07:36:16Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "6 bootstrap tutorial | color in bootstrap learn text color and bg color",
        description:
          "الالوان في البوتستراب\nblue: #007bff\nindigo: #6610f2\n purple: #6f42c1\n pink: #e83e8c\n  red: #dc3545\n  orange: #fd7e14\n  yellow: #ffc107\n  green: #28a745\n  teal: #20c997\n  cyan: #17a2b8\n  white: #fff\n  gray: #6c757d\n  gray-dark: #343a40\n  primary: #007bff\n  secondary: #6c757;\n  success: #28a745\n  info: #17a2b8\n  warning: #ffc107\n  -danger: #dc3545\n  light: #f8f9fa\n  dark: #343a40\nما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب \n \nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحي\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\n\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/qTc6tgf7UnY/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/qTc6tgf7UnY/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/qTc6tgf7UnY/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/qTc6tgf7UnY/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/qTc6tgf7UnY/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 5,
        resourceId: {
          kind: "youtube#video",
          videoId: "qTc6tgf7UnY",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "NuJJd8bO9VefztA1c20gJSO4Cz8",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay41MzJCQjBCNDIyRkJDN0VD",
      snippet: {
        publishedAt: "2020-11-19T07:38:54Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "7 bootstrap tutorial | create alert in bootstrap",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/JcyxeEK7o40/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/JcyxeEK7o40/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/JcyxeEK7o40/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/JcyxeEK7o40/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/JcyxeEK7o40/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 6,
        resourceId: {
          kind: "youtube#video",
          videoId: "JcyxeEK7o40",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "21dpiJYY2wN-rLcaFqLNxE2NK_Q",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5DQUNERDQ2NkIzRUQxNTY1",
      snippet: {
        publishedAt: "2020-11-19T07:39:03Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "8 bootstrap tutorial | create button in bootstrap btn",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/4es9yuiLyOs/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/4es9yuiLyOs/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/4es9yuiLyOs/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/4es9yuiLyOs/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/4es9yuiLyOs/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 7,
        resourceId: {
          kind: "youtube#video",
          videoId: "4es9yuiLyOs",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "QP-lswhmBZNGd8wbpyW9u6aa_T0",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay45NDk1REZENzhEMzU5MDQz",
      snippet: {
        publishedAt: "2020-11-19T07:39:13Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "9 bootstrap tutorial | create btn group and btn toolbar in bootstrap",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/vOco35gzbZs/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/vOco35gzbZs/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/vOco35gzbZs/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/vOco35gzbZs/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/vOco35gzbZs/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 8,
        resourceId: {
          kind: "youtube#video",
          videoId: "vOco35gzbZs",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "-QmgoHhk8eWUOBDBzzsBvV59jso",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5GNjNDRDREMDQxOThCMDQ2",
      snippet: {
        publishedAt: "2020-11-19T07:39:21Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "10 bootstrap tutorial | تطبيق عملي مهمة على كل اللي فات",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/9omoADunqJw/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/9omoADunqJw/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/9omoADunqJw/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/9omoADunqJw/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/9omoADunqJw/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 9,
        resourceId: {
          kind: "youtube#video",
          videoId: "9omoADunqJw",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "zVs8yKnKJcB9Mlqfncjiiaz0iis",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay40NzZCMERDMjVEN0RFRThB",
      snippet: {
        publishedAt: "2020-11-20T03:23:08Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "11 bootstrap tutorial | create cards",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/wv6ZdsdTETo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/wv6ZdsdTETo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/wv6ZdsdTETo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/wv6ZdsdTETo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/wv6ZdsdTETo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 10,
        resourceId: {
          kind: "youtube#video",
          videoId: "wv6ZdsdTETo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "vxbs3Bo1vxIC8Gm-IQbVcgC74JQ",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5EMEEwRUY5M0RDRTU3NDJC",
      snippet: {
        publishedAt: "2020-11-22T01:58:25Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "12 bootstrap tutorial create badges",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/Sf-YTVpYMgA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/Sf-YTVpYMgA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/Sf-YTVpYMgA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/Sf-YTVpYMgA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/Sf-YTVpYMgA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 11,
        resourceId: {
          kind: "youtube#video",
          videoId: "Sf-YTVpYMgA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "8ki2TwCdrZ23Qi5iRlbb362FbJE",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4zMDg5MkQ5MEVDMEM1NTg2",
      snippet: {
        publishedAt: "2020-11-22T02:02:14Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "13 bootstrap tutorial | create slide in bootstrap",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/z0urS1e77pc/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/z0urS1e77pc/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/z0urS1e77pc/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/z0urS1e77pc/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/z0urS1e77pc/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 12,
        resourceId: {
          kind: "youtube#video",
          videoId: "z0urS1e77pc",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "XiWotIFdq1Yc5_NnrL0ptcAGGKw",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay45ODRDNTg0QjA4NkFBNkQy",
      snippet: {
        publishedAt: "2020-11-22T02:00:20Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "14 bootstrap 4 tutorial create slide 2  in bootstrap",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/DooctvG-tc0/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/DooctvG-tc0/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/DooctvG-tc0/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/DooctvG-tc0/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/DooctvG-tc0/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 13,
        resourceId: {
          kind: "youtube#video",
          videoId: "DooctvG-tc0",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "hAWFo3y67y2rsMX_Mi-Bv-mUW0U",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay41Mzk2QTAxMTkzNDk4MDhF",
      snippet: {
        publishedAt: "2020-11-23T10:51:33Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "15 -  bootstrap tutorial | dropdown",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/1L8LSkvxx60/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/1L8LSkvxx60/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/1L8LSkvxx60/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/1L8LSkvxx60/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/1L8LSkvxx60/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 14,
        resourceId: {
          kind: "youtube#video",
          videoId: "1L8LSkvxx60",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "Lh-akygePZE0QVCbDEWmAw1ekvo",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5EQUE1NTFDRjcwMDg0NEMz",
      snippet: {
        publishedAt: "2020-11-23T10:53:53Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "16 - bootstrap tutorial | breadcrumb",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/kydoceFHBqo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/kydoceFHBqo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/kydoceFHBqo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/kydoceFHBqo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/kydoceFHBqo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 15,
        resourceId: {
          kind: "youtube#video",
          videoId: "kydoceFHBqo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "rXrXY4hPpLG9aIh_fEk5E2ijapw",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay41QTY1Q0UxMTVCODczNThE",
      snippet: {
        publishedAt: "2020-11-23T10:57:28Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "17 - bootstrap tutorial | collapse",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/4Lx_gRsrZdo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/4Lx_gRsrZdo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/4Lx_gRsrZdo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/4Lx_gRsrZdo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/4Lx_gRsrZdo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 16,
        resourceId: {
          kind: "youtube#video",
          videoId: "4Lx_gRsrZdo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "t1897gueBHrtNNkLEXVmXXFohE8",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4yMUQyQTQzMjRDNzMyQTMy",
      snippet: {
        publishedAt: "2020-11-23T11:01:33Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "18 - bootstrap tutorial | form in bootstrap",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/CjI3QnsgJcc/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/CjI3QnsgJcc/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/CjI3QnsgJcc/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/CjI3QnsgJcc/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/CjI3QnsgJcc/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 17,
        resourceId: {
          kind: "youtube#video",
          videoId: "CjI3QnsgJcc",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "ZU6GphI9dkvuwUkEPHaNWVBvQpY",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay45RTgxNDRBMzUwRjQ0MDhC",
      snippet: {
        publishedAt: "2020-11-23T11:02:26Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "19 - bootstrap tutorial | input group",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/8q9jYQN8Hs4/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/8q9jYQN8Hs4/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/8q9jYQN8Hs4/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/8q9jYQN8Hs4/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/8q9jYQN8Hs4/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 18,
        resourceId: {
          kind: "youtube#video",
          videoId: "8q9jYQN8Hs4",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "-x2XFDkjGivbHrboeX2PLVv0lF8",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5ENDU4Q0M4RDExNzM1Mjcy",
      snippet: {
        publishedAt: "2020-11-23T11:03:18Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "20 - bootstrap tutorial | jumbotron",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/XUhsdgJT6YA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/XUhsdgJT6YA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/XUhsdgJT6YA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/XUhsdgJT6YA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/XUhsdgJT6YA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 19,
        resourceId: {
          kind: "youtube#video",
          videoId: "XUhsdgJT6YA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "PtphhE8Tzx7g-Ed6RhA3axcyy1Q",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4yMDhBMkNBNjRDMjQxQTg1",
      snippet: {
        publishedAt: "2020-11-23T11:03:49Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "21 - bootstrap tutorial | create navbar part 1",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/vcko5MhS0xo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/vcko5MhS0xo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/vcko5MhS0xo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/vcko5MhS0xo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/vcko5MhS0xo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 20,
        resourceId: {
          kind: "youtube#video",
          videoId: "vcko5MhS0xo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "oX1Q6veeIjZ8lLcyyg2XacS8fS0",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5GM0Q3M0MzMzY5NTJFNTdE",
      snippet: {
        publishedAt: "2020-11-23T11:05:13Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "22 - bootstrap tutorial | create navbar part 2",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/qgWdk4NeAmA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/qgWdk4NeAmA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/qgWdk4NeAmA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/qgWdk4NeAmA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/qgWdk4NeAmA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 21,
        resourceId: {
          kind: "youtube#video",
          videoId: "qgWdk4NeAmA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "61F90tneo560Vh7lRFxwHX06qws",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay45NzUwQkI1M0UxNThBMkU0",
      snippet: {
        publishedAt: "2020-11-23T13:35:50Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "23 - bootstrap tutorial | create progress bar",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/qEN6RDSl3hs/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/qEN6RDSl3hs/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/qEN6RDSl3hs/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/qEN6RDSl3hs/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/qEN6RDSl3hs/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 22,
        resourceId: {
          kind: "youtube#video",
          videoId: "qEN6RDSl3hs",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "ewrzWxz4FdDTGXJ69JnV4Voznew",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay4zRjM0MkVCRTg0MkYyQTM0",
      snippet: {
        publishedAt: "2020-11-23T11:59:08Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "24 - bootstrap tutorial | model",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/E64-eRc4gQk/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/E64-eRc4gQk/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/E64-eRc4gQk/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/E64-eRc4gQk/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/E64-eRc4gQk/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 23,
        resourceId: {
          kind: "youtube#video",
          videoId: "E64-eRc4gQk",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "SHM35dusmq057GoGkeYK0tkzzY4",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay5DNzE1RjZEMUZCMjA0RDBB",
      snippet: {
        publishedAt: "2020-11-23T13:37:32Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "25 - bootstrap tutorial | pagination",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/MEVwNigS2t4/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/MEVwNigS2t4/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/MEVwNigS2t4/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/MEVwNigS2t4/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/MEVwNigS2t4/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 24,
        resourceId: {
          kind: "youtube#video",
          videoId: "MEVwNigS2t4",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "uEt2TVzSdge5Kae14VoMALA2MUc",
      id: "UExrbndFbUtzVzhPc2NMOUd2anh3TDdSWWJjd3dkSWl0ay43MTI1NDIwOTMwQjIxMzNG",
      snippet: {
        publishedAt: "2020-11-29T10:57:25Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "بناء موقع كامل بالبوتستراب 4 | تعلم كيفية تصميم واجهة موقع الكتروني بالبوتستراب",
        description:
          "ما هي بوتستراب Bootstrap؟\nبوتستراب Bootstrap هي إحدى أشهر المكتبات التي يستخدمها مبرمجو المواقع الإلكترونية على الإطلاق، حيث أن تطوير المواقع بشكله الحديث لم يعد يحتاج لإعادة كتابة كل حركةٍ وكل عنصرٍ من صفحات الموقع، وأصبح تنظيم الصفحة أمرًا بسيطًا بمساعدة بعض المكتبات الخارجية الشهيرة وعلى رأسها Bootstrap.\nلعلك سمعت كثيرًا عن اطار العمل الشهير Bootstrap الذى يستخدمه الكثير من مصممى واجهة المستخدم فى الويب فى هذه الايام سنتعرف اليوم على البوتستراب وكيفية عمله ومثال عليه.\nكيف يعمل البوتسراب ؟ \nنقوم بأعطاء كلس معين وهذا الكلاس معرف فى ملفات البوتسراب لعمل وظيفة معينة\n \nمثال بسيط على ذلك\nما هي بوتستراب Bootstrap\nهي إحدى أشهر وأقوى المكتبات التي تجمع HTML وCSS وJS لبناء صفحات ومواقع وتطبيقات الويب، وهي تفيد بشكلٍ أساسيٍّ في بناء مواقعٍ متناسقةٍ مع مختلف أحجام وقياسات الشاشات، بما في ذلك شاشات الهواتف الخلوية والأجهزة اللوحية، وهي مكتبةٌ مجانيةٌ ومفتوحة المصدر تتوفر للجميع على موقع Github وتم بناؤها من قبل شركة Twitter ولها.1\n\nميزات بوتستراب Bootstrap\nانتشرت مكتبة بوتستراب Bootstrap بشكلٍ كبيرٍ منذ إطلاقها عام 2011 بشكلٍ مجانيٍّ، وأحبها المبرمجون حول العالم ولم يكن ذلك بمحض الصدفة بل وراء نجاح هذه المكتبة الكثير من الميزات الهامة ومنها:\nالمرونة الكبيرة والسهولة في الاستخدام.\nالتصميم المتوافق مع جميع الأجهزة.\nتتوافق مع كافة المتصفحات.\nتقدم تصميم ثابت وقابل لإعادة الاستخدام.\nيمكن تعلمها بشكل سهل وسريع.\nقابلية كبيرة للتوسع باستخدام لغة JavaScript.\nتحوي دعمًا مسبقًا للـ JQuery.\nدعم للـ API الخاصة بلغة Javascript.\nيمكن استخدامها ضمن أي محررٍ أو بيئةٍ برمجيةٍ.\nتتوافق مع أي تقنيةٍ أو لغة ضمن السيرفر مثل: ASP.NET – PHP – Ruby.2\nمحتويات المكتبة\nتحوي مكتبة بوتستراب Bootstrap على مجموعةٍ من الملفات البرمجية الخاصة بالواجهات، من ملفات CSS وملفات JS وعناصر مختلفة ضمنها بالإضافة إلى بعض الخطوط والمواضيع التي تساعد على بناء موقعٍ متناسقٍ، حيث يقوم المبرمج بتضمين المكتبة في المشروع البرمجي الذي يعمل عليه ليستخدم كل تلك الملفات والميزات الموجودة فيها، ويمكن أيضًا نقلها إلى أي مكانٍ ضمن المشروع حسب الرغبة مع التأكيد على ضرورة وضع ملفات الخط في مجلد ملفات الـ CSS، وهنا الهيكل العام للمكتبة يحوي الملفات الأساسية فقط ومن الواضح أنه بسيطٌ ويشرح نفسه بنفسه\nما الذي يجعل بوتستراب Bootstrap تلائم كل شيء\nبنيت مكتبة بوتستراب Bootstrap بطريقةٍ تجعلها تعمل بنفس الجودة في كل مكانٍ، ولعل أهم النقاط التي تجعلها بتلك القوة هي:\n\nالشبكة الخاصة بمكتبة بوتستراب والتي تقوم بعملية تقسيم الشاشة (مهما كان قياسها) ليتم توزيع العناصر فيها بسهولةٍ، وهذا يوفر الكثير من الوقت الذي يقضيه المبرمجون عادةً في بناء شبكتهم الخاصة أثناء بناء الموقع، وتتيح هنا عدة خياراتٍ للأعمدة التي يمكن أن تكون صغيرةً أو متوسطةً أو كبيرةً أو كبيرةً جدًا حسب حاجة الموقع.\nتوفر مكتبة بوتستراب Bootstrap طرقًا مسبقةً لجعل الصور متوافقةً مع التصميم، عن طريق تحجيم الصورة بما يتلاءم مع حجم الشاشة، وذلك فقط بإضافة الكلاس img-responsive إلى الصور الموجودة في الموقع وستتولى المكتبة باقي المهمة، كما يمكن تغيير شكل الصورة عن طريق كلاساتٍ أخرى مثل  img-circle و img-rounded.\nتحتوي مكتبة بوتستراب عناصرَ معدة مسبقًا يمكنك ببساطةٍ استخدامها في موقعك الإلكتروني، وهي عناصرٌ هامةٌ كانت تشكل عبئًا كبيرًا على المبرمجين في السابق مثل:Navigation bars – Dropdowns – Progress bars – Thumbnails وغيرها من العناصر التي لا يمكن الاستغناء عنها والتي ستجعلك تبني تصميمًا رائعًا دون الخوف من ظهوره في مختلف قياسات الشاشات.\nبالإضافة لكل التوابع الموجودة في بوتستراب فإنها تحوي الكثير والكثير من الإضافات الخاصة بالـ jQuery والتي تحوي القوة والسهولة والمزيد من المرونة في صفحات الموقع، حيث تقدم حلولًا سريعةً وقويةً لكل ما يتعلق بالصور و التنقلات و الـ modals، وعدة إضافاتٍ أخرى.\nتوثيق المكتبة ضمن موقعها الرسمي هو أحد أكثر الميزات المذهلة لها، حيث يمكن معرفة كل شيءٍ عنها بالتفصيل وكل ما يخص طريقة الاستخدام والعناصر الموجودة فيها، إذ يتوفر شرحٌ تفصيليٌّ لكل جزءٍ منها، بالإضافة لوجود أمثلةٍ خاصةٍ لكل جزءٍ وهو ما يهتم به المبتدئين في استخدام هذه المكتبة حيث يمكن نسخ ولصق كود أي عنصرٍ فيها ببساطةٍ.\nيمكن لمستخدمي هذه المكتبة تخصيص الميزات التي يودون استخدامها حيث أن المكتبة كبيرةُ الحجم نسبيًا ويعد هذا التخصيص أمرًا هامًا في التطبيقات الكبيرة.\nلدى مكتبة جمهور كبير من المبرمجين والذي يجعلها أكثر سهولةٍ حيث يجد المبتدئ كل ما يسأل عنه متوفرًا بسهولةٍ ولها أيضًا صفحة خاصة على تويتر ومدونة.\nومع تزايد انتشارها بدأ المطورون في إنشاء قوالبٍ جاهزةٍ بالاعتماد عليها لتسريع عمليات التطوير ويوجد مواقعٌ متخصصةٌ في شراء وتبادل القوالب\nكما تلاحظ، لدينا btn و btn-success و btn-lg كلها ستصنع لنا زر كبير وأخضر، رأيت كم الأمر بسيط وسهل وسريع، ولا يحتاج كتابة أي كود ويوجد الكثير من الكلسات الخاصة بالازار والفورمات والنصوص والصور والتعامل مع اي عنصر تقريبًا css\nوالحصول على تلك الاكود من الموقع الرسمى هنا\n \nوالان الى النقطة الاهم فى اطار العمل \n\nوهى Boostrap Grid System \nنظام يقوم ببناء الموقع على هيئة صفوف واعمدة وهذا لجعل الموقع متجاوب ويمكنه العمل على جميع مقاسات الشاشات \n \nفمثلًا تقسيمة الموقع فى الصورة هى للشاشات الكبيرة اما فى حالة التابلت او الموبيل فالشكل سيختلف\nحتى تمكن قارئ المدونة من تصفح المدونة بشكل اسهل فيكون على الشكل \nقواعد البوتستراب\nيجب ان يكون كلاسات row داخل  .container  للعرض الثابت للصفحة او .container-fluid للعرض الكامل \nيستخدم row لعمل مجموعة افقة من الاعمدة \nالمحتوي يفضل ان يوضع داخل الاعمدة فقط",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/KmbZhEgg_zU/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/KmbZhEgg_zU/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/KmbZhEgg_zU/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/KmbZhEgg_zU/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/KmbZhEgg_zU/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk",
        position: 25,
        resourceId: {
          kind: "youtube#video",
          videoId: "KmbZhEgg_zU",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
  ],
  pageInfo: {
    totalResults: 26,
    resultsPerPage: 50,
  },
};

let htmlItems = htmlJson.items;
let htmlLength = htmlItems.length;
let toggle = document.querySelector(".toggle");
let btnList = document.querySelector(".btnList");

for (let i = 0; i < htmlLength; i++) {
  console.log(htmlItems[i].snippet.resourceId.videoId);
}

// toggle function
toggle.addEventListener("click", () => {
  if (btnList.style.display == "none") {
    btnList.setAttribute(
      "style",
      "display:block; position:fixed; top:55px; width:50%;"
    );
  } else {
    btnList.setAttribute("style", "display:none");
  }
});

document.querySelector(".title").innerHTML = htmlItems[0].snippet.title;

for (let i = 0; i < htmlLength; i++) {
  let lessonBtn = document.createElement("button");
  let btnText = document.createTextNode(`Lesson ${i + 1}`);
  lessonBtn.classList.add("lessonBtn");
  lessonBtn.appendChild(btnText);
  btnList.appendChild(lessonBtn);
}
let lessonBtn = document.querySelectorAll(".lessonBtn");
for (let i = 0; i < htmlLength; i++) {
  lessonBtn[i].addEventListener("click", () => {
    document.getElementById(
      "videoFrame"
    ).src = `https://www.youtube.com/embed/${htmlItems[i].snippet.resourceId.videoId}?list=PLknwEmKsW8OscL9GvjxwL7RYbcwwdIitk`;
        document.querySelector(".title").innerHTML = htmlItems[i].snippet.title;
  });
}
