// select elements
let htmlJson = {
  kind: "youtube#playlistItemListResponse",
  etag: "ZmV7eyxa3XE11gLkHFRy8Gf_ko4",
  items: [
    {
      kind: "youtube#playlistItem",
      etag: "YKgVaIZBSjfsgm8Uqi3v2Rexo08",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS41NkI0NEY2RDEwNTU3Q0M2",
      snippet: {
        publishedAt: "2020-11-05T05:47:12Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "1 Django tutorial | كورس دجانجو | ما هو الدجانجو؟",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/UPFKAG9rYOE/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/UPFKAG9rYOE/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/UPFKAG9rYOE/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/UPFKAG9rYOE/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/UPFKAG9rYOE/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 0,
        resourceId: {
          kind: "youtube#video",
          videoId: "UPFKAG9rYOE",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "HNmApy_45c7NCwlO3uIA1GRgGH8",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4yODlGNEE0NkRGMEEzMEQy",
      snippet: {
        publishedAt: "2020-11-05T05:53:04Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "2 Django tutorial | كورس دجانجو | تثبيت البيئة الافتراضية على النظام؟",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/_MAdUhH49so/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/_MAdUhH49so/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/_MAdUhH49so/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/_MAdUhH49so/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/_MAdUhH49so/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 1,
        resourceId: {
          kind: "youtube#video",
          videoId: "_MAdUhH49so",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "E8iMZeDdctjy0fV8bVLRU17j6KQ",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4wMTcyMDhGQUE4NTIzM0Y5",
      snippet: {
        publishedAt: "2020-11-06T02:11:56Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "3 Django tutorial | كورس دجانجو | ceate project by django",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/jWnGoaOnW2A/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/jWnGoaOnW2A/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/jWnGoaOnW2A/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/jWnGoaOnW2A/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/jWnGoaOnW2A/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 2,
        resourceId: {
          kind: "youtube#video",
          videoId: "jWnGoaOnW2A",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "LLOgTbj61ZqvCXcsyXIVGn5AG7E",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS41MjE1MkI0OTQ2QzJGNzNG",
      snippet: {
        publishedAt: "2020-11-06T02:14:28Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "4 Django tutorial | كورس دجانجو | التعرف على ملفات المشروع",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/ASCBwYq3IpE/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/ASCBwYq3IpE/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/ASCBwYq3IpE/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/ASCBwYq3IpE/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/ASCBwYq3IpE/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 3,
        resourceId: {
          kind: "youtube#video",
          videoId: "ASCBwYq3IpE",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "bwzo--NFAl3W6jzEXOnc35xP6pk",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4wOTA3OTZBNzVEMTUzOTMy",
      snippet: {
        publishedAt: "2020-11-06T03:15:44Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "5 Django tutorial | كورس دجانجو | كيف يعمل دجانجو",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/wfDnZSEI970/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/wfDnZSEI970/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/wfDnZSEI970/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/wfDnZSEI970/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/wfDnZSEI970/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 4,
        resourceId: {
          kind: "youtube#video",
          videoId: "wfDnZSEI970",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "OFJ6xDzEAnRUnoh8e25xQQNnySY",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4xMkVGQjNCMUM1N0RFNEUx",
      snippet: {
        publishedAt: "2020-11-06T03:17:58Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "6 Django tutorial | كورس دجانجو | create apps",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/9YA5dyUfNsI/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/9YA5dyUfNsI/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/9YA5dyUfNsI/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/9YA5dyUfNsI/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/9YA5dyUfNsI/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 5,
        resourceId: {
          kind: "youtube#video",
          videoId: "9YA5dyUfNsI",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "AXl-p0fJEXBb7IQnI3VNWS7kHyM",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS41MzJCQjBCNDIyRkJDN0VD",
      snippet: {
        publishedAt: "2020-11-06T04:22:01Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "7 Django tutorial | كورس دجانجو | views",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/fqI6nOlnqIg/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/fqI6nOlnqIg/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/fqI6nOlnqIg/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/fqI6nOlnqIg/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/fqI6nOlnqIg/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 6,
        resourceId: {
          kind: "youtube#video",
          videoId: "fqI6nOlnqIg",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "4eZUvVQn-U2_rd8ZlOIP2m7Dw4w",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5DQUNERDQ2NkIzRUQxNTY1",
      snippet: {
        publishedAt: "2020-11-06T04:41:34Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "8 Django tutorial | كورس دجانجو | urls",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/rFWkQjN6Kc0/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/rFWkQjN6Kc0/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/rFWkQjN6Kc0/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/rFWkQjN6Kc0/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/rFWkQjN6Kc0/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 7,
        resourceId: {
          kind: "youtube#video",
          videoId: "rFWkQjN6Kc0",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "ncktfKwGzE9MT_LjGRfHx_0lK2E",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS45NDk1REZENzhEMzU5MDQz",
      snippet: {
        publishedAt: "2020-11-06T04:41:49Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "9 Django tutorial | كورس دجانجو | templates",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/gYki_75QPV8/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/gYki_75QPV8/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/gYki_75QPV8/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/gYki_75QPV8/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/gYki_75QPV8/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 8,
        resourceId: {
          kind: "youtube#video",
          videoId: "gYki_75QPV8",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "MCtpa7pihC-Y9pTWcLeUhf313LI",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5GNjNDRDREMDQxOThCMDQ2",
      snippet: {
        publishedAt: "2020-11-06T04:42:21Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "10 Django tutorial | كورس دجانجو | context in views",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/1cSPcVc_UTs/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/1cSPcVc_UTs/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/1cSPcVc_UTs/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/1cSPcVc_UTs/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/1cSPcVc_UTs/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 9,
        resourceId: {
          kind: "youtube#video",
          videoId: "1cSPcVc_UTs",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "wTZshBipTFe3dPR9dnjzmOwvm9g",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS40NzZCMERDMjVEN0RFRThB",
      snippet: {
        publishedAt: "2020-11-06T04:42:25Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "11 Django tutorial | كورس دجانجو | filter DTL",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/ueRIlG6KMfo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/ueRIlG6KMfo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/ueRIlG6KMfo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/ueRIlG6KMfo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/ueRIlG6KMfo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 10,
        resourceId: {
          kind: "youtube#video",
          videoId: "ueRIlG6KMfo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "hugg6RuqXDvoyS0XsIfzVO5mu80",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5EMEEwRUY5M0RDRTU3NDJC",
      snippet: {
        publishedAt: "2020-11-08T04:32:14Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "12 Django tutorial | كورس دجانجو | tags extends",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/CsRafG1pt0w/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/CsRafG1pt0w/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/CsRafG1pt0w/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/CsRafG1pt0w/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/CsRafG1pt0w/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 11,
        resourceId: {
          kind: "youtube#video",
          videoId: "CsRafG1pt0w",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "UvQigRB1eR5a69L8Tr9hFyhUQhE",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS45ODRDNTg0QjA4NkFBNkQy",
      snippet: {
        publishedAt: "2020-11-08T04:32:26Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "13 Django tutorial | كورس دجانجو | tags block",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/GjsEwgb-YgA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/GjsEwgb-YgA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/GjsEwgb-YgA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/GjsEwgb-YgA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/GjsEwgb-YgA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 12,
        resourceId: {
          kind: "youtube#video",
          videoId: "GjsEwgb-YgA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "Y5dFDZsyfh5ydsakgfLKNLWVJsg",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4zMDg5MkQ5MEVDMEM1NTg2",
      snippet: {
        publishedAt: "2020-11-08T04:32:37Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "14 Django tutorial | كورس دجانجو | tags include",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/F5F3qnKhphs/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/F5F3qnKhphs/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/F5F3qnKhphs/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/F5F3qnKhphs/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/F5F3qnKhphs/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 13,
        resourceId: {
          kind: "youtube#video",
          videoId: "F5F3qnKhphs",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "CXM2T_w0LdrZADsKRDS_gOBGR0E",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS41Mzk2QTAxMTkzNDk4MDhF",
      snippet: {
        publishedAt: "2020-11-08T04:32:49Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "15 Django tutorial | كورس دجانجو | tags if and for",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/ulVH5Wvr_eI/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/ulVH5Wvr_eI/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/ulVH5Wvr_eI/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/ulVH5Wvr_eI/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/ulVH5Wvr_eI/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 14,
        resourceId: {
          kind: "youtube#video",
          videoId: "ulVH5Wvr_eI",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "l_tKEDgqTbzUiLh9uTrTjbtDt1k",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5EQUE1NTFDRjcwMDg0NEMz",
      snippet: {
        publishedAt: "2020-11-08T04:33:00Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "16 Django tutorial | كورس دجانجو | static files",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/i_4an71mihc/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/i_4an71mihc/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/i_4an71mihc/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/i_4an71mihc/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/i_4an71mihc/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 15,
        resourceId: {
          kind: "youtube#video",
          videoId: "i_4an71mihc",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "6sLqy603_DYBwBKPo_-ya3T-r80",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS41QTY1Q0UxMTVCODczNThE",
      snippet: {
        publishedAt: "2020-11-08T04:33:10Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "17 Django tutorial | كورس دجانجو | tags url",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/pcLnM_PTo_A/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/pcLnM_PTo_A/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/pcLnM_PTo_A/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/pcLnM_PTo_A/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/pcLnM_PTo_A/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 16,
        resourceId: {
          kind: "youtube#video",
          videoId: "pcLnM_PTo_A",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "RDlXpyG2XKKyAx8hMBFnMj2YUDA",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4yMUQyQTQzMjRDNzMyQTMy",
      snippet: {
        publishedAt: "2020-11-08T04:33:20Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "18 Django tutorial | كورس دجانجو | models",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/MjpGveK-9Yo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/MjpGveK-9Yo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/MjpGveK-9Yo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/MjpGveK-9Yo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/MjpGveK-9Yo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 17,
        resourceId: {
          kind: "youtube#video",
          videoId: "MjpGveK-9Yo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "SW2OWhDddIfW85LDd78nQUFD0Dc",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS45RTgxNDRBMzUwRjQ0MDhC",
      snippet: {
        publishedAt: "2020-11-08T04:33:36Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "19 Django tutorial | كورس دجانجو | models create table",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/ZV_iJgMvIvQ/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/ZV_iJgMvIvQ/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/ZV_iJgMvIvQ/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/ZV_iJgMvIvQ/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/ZV_iJgMvIvQ/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 18,
        resourceId: {
          kind: "youtube#video",
          videoId: "ZV_iJgMvIvQ",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "MpcTcwsn_0AIr0JxeHAwpJpLBkg",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5ENDU4Q0M4RDExNzM1Mjcy",
      snippet: {
        publishedAt: "2020-11-08T04:33:46Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "20 Django tutorial | كورس دجانجو | models add data in database",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/tZRUYcgzv7U/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/tZRUYcgzv7U/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/tZRUYcgzv7U/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/tZRUYcgzv7U/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/tZRUYcgzv7U/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 19,
        resourceId: {
          kind: "youtube#video",
          videoId: "tZRUYcgzv7U",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "t0XBqEI9rywVqCE5mQrVqV_bvJI",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4yMDhBMkNBNjRDMjQxQTg1",
      snippet: {
        publishedAt: "2020-11-08T04:33:58Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "21 Django tutorial | كورس دجانجو | models show products on tamplate",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/7JTMINRtiqM/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/7JTMINRtiqM/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/7JTMINRtiqM/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/7JTMINRtiqM/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/7JTMINRtiqM/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 20,
        resourceId: {
          kind: "youtube#video",
          videoId: "7JTMINRtiqM",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "YOTLMzM6TzBUun8BfAD3mfaeWpo",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5GM0Q3M0MzMzY5NTJFNTdE",
      snippet: {
        publishedAt: "2020-11-08T04:34:09Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "22 Django tutorial | كورس دجانجو | models class Meta",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/O24vqRcRMN0/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/O24vqRcRMN0/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/O24vqRcRMN0/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/O24vqRcRMN0/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/O24vqRcRMN0/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 21,
        resourceId: {
          kind: "youtube#video",
          videoId: "O24vqRcRMN0",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "JKNaldXhmSk0vHXNdQll8odd288",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4zRjM0MkVCRTg0MkYyQTM0",
      snippet: {
        publishedAt: "2020-11-08T04:34:22Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "23 Django tutorial | كورس دجانجو | models field methods",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/YYUE86-lrrY/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/YYUE86-lrrY/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/YYUE86-lrrY/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/YYUE86-lrrY/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/YYUE86-lrrY/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 22,
        resourceId: {
          kind: "youtube#video",
          videoId: "YYUE86-lrrY",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "ulNiU9wChc8EkmxyPEbczsZnZyY",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS45NzUwQkI1M0UxNThBMkU0",
      snippet: {
        publishedAt: "2020-11-08T04:34:28Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "24 Django tutorial | كورس دجانجو | models create field date and time and datetimefield",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/qV4jMOK_uSc/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/qV4jMOK_uSc/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/qV4jMOK_uSc/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/qV4jMOK_uSc/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/qV4jMOK_uSc/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 23,
        resourceId: {
          kind: "youtube#video",
          videoId: "qV4jMOK_uSc",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "i_LY8J99xMBcM0L-hnfAVhwzHys",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5DNzE1RjZEMUZCMjA0RDBB",
      snippet: {
        publishedAt: "2020-11-08T04:34:43Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "25 Django tutorial | كورس دجانجو | models ما هي أنواع العلاقات بين الجداول في Relationship Database",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/tFBzbGo_HsU/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/tFBzbGo_HsU/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/tFBzbGo_HsU/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/tFBzbGo_HsU/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/tFBzbGo_HsU/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 24,
        resourceId: {
          kind: "youtube#video",
          videoId: "tFBzbGo_HsU",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "6lMDzV8ZDBd3Rwo5Pj1tuqR7mfg",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS43MTI1NDIwOTMwQjIxMzNG",
      snippet: {
        publishedAt: "2020-11-08T04:34:53Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "26 Django tutorial | كورس دجانجو | query set by get and filter and all",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/mlT8FC4Wltk/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/mlT8FC4Wltk/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/mlT8FC4Wltk/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/mlT8FC4Wltk/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/mlT8FC4Wltk/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 25,
        resourceId: {
          kind: "youtube#video",
          videoId: "mlT8FC4Wltk",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "rCamgnTbEWIathSsJShn4YRFkGk",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5DQ0MyQ0Y4Mzg0M0VGOEYw",
      snippet: {
        publishedAt: "2020-11-08T04:35:02Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "27 Django tutorial | كورس دجانجو | query set exclude and order by and count objects",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/GM2M2BRPnvA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/GM2M2BRPnvA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/GM2M2BRPnvA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/GM2M2BRPnvA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/GM2M2BRPnvA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 26,
        resourceId: {
          kind: "youtube#video",
          videoId: "GM2M2BRPnvA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "jYElz9LYp_9GAmbvbMZgZ682kZA",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4yQUE2Q0JEMTk4NTM3RTZC",
      snippet: {
        publishedAt: "2020-11-08T04:35:06Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "28 Django tutorial | كورس دجانجو | query set range and in and exact",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/UNa2dP-Z7x0/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/UNa2dP-Z7x0/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/UNa2dP-Z7x0/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/UNa2dP-Z7x0/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/UNa2dP-Z7x0/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 27,
        resourceId: {
          kind: "youtube#video",
          videoId: "UNa2dP-Z7x0",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "RtIb8NaLir2_T9T8Ti1AexenzeM",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5DMkU4NTY1QUFGQTYwMDE3",
      snippet: {
        publishedAt: "2020-11-08T04:35:22Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "29 Django tutorial | كورس دجانجو | media files media root media url",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/iBgmQEQash4/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/iBgmQEQash4/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/iBgmQEQash4/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/iBgmQEQash4/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/iBgmQEQash4/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 28,
        resourceId: {
          kind: "youtube#video",
          videoId: "iBgmQEQash4",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "6yv6Up68OFkLx0WQGdqGkJjRkNk",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS44Mjc5REFBRUE2MTdFRDU0",
      snippet: {
        publishedAt: "2020-11-08T04:35:31Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "30 Django tutorial | كورس دجانجو | forms create form login from a to z",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/RDbRDvfRpkI/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/RDbRDvfRpkI/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/RDbRDvfRpkI/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/RDbRDvfRpkI/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/RDbRDvfRpkI/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 29,
        resourceId: {
          kind: "youtube#video",
          videoId: "RDbRDvfRpkI",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "C8koYqDhUytpC9cDhRlmh8tbk8E",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS43NDhFRTgwOTRERTU4Rjg3",
      snippet: {
        publishedAt: "2020-11-08T04:35:40Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "31  Django tutorial | كورس دجانجو | forms by django form",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/XoBlgfRSHf8/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/XoBlgfRSHf8/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/XoBlgfRSHf8/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/XoBlgfRSHf8/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/XoBlgfRSHf8/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 30,
        resourceId: {
          kind: "youtube#video",
          videoId: "XoBlgfRSHf8",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "LyOB5nCOl7RQbp-MWzDYxRWSxfc",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS41QUZGQTY5OTE4QTREQUU4",
      snippet: {
        publishedAt: "2020-11-08T04:35:51Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title: "32 Django tutorial | كورس دجانجو | forms values",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/Al5Th0zZB8Y/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/Al5Th0zZB8Y/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/Al5Th0zZB8Y/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/Al5Th0zZB8Y/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/Al5Th0zZB8Y/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 31,
        resourceId: {
          kind: "youtube#video",
          videoId: "Al5Th0zZB8Y",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "4Zx0smLXMsz6xLJlpFEvWhFac3g",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS4zRDBDOEZDOUM0MDY5NEEz",
      snippet: {
        publishedAt: "2020-11-08T04:36:00Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "33 Django tutorial | كورس دجانجو | forms extend database field to class form",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/vxkenGVWWWo/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/vxkenGVWWWo/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/vxkenGVWWWo/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/vxkenGVWWWo/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/vxkenGVWWWo/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 32,
        resourceId: {
          kind: "youtube#video",
          videoId: "vxkenGVWWWo",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "9rEZ-r1DK_IoOjYME_x0Ahw1Ex4",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5CMEQ2Mjk5NTc3NDZFRUNB",
      snippet: {
        publishedAt: "2020-11-08T04:36:12Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "34 Django tutorial | كورس دجانجو | حماية بيانات المستخدم و حل جميع مشاكل الفورم",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/Bx6uGMsVrpA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/Bx6uGMsVrpA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/Bx6uGMsVrpA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/Bx6uGMsVrpA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/Bx6uGMsVrpA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 33,
        resourceId: {
          kind: "youtube#video",
          videoId: "Bx6uGMsVrpA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "0H7-LDrSS451UNkjzqkK33FFXC0",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS42MTI4Njc2QjM1RjU1MjlG",
      snippet: {
        publishedAt: "2020-11-11T23:18:48Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "35 Django tutorial | كورس دجانجو | تعديل الادمن بانل | Customise the Django admin",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/3P78wNcEviI/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/3P78wNcEviI/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/3P78wNcEviI/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/3P78wNcEviI/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/3P78wNcEviI/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 34,
        resourceId: {
          kind: "youtube#video",
          videoId: "3P78wNcEviI",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "BECmHVbUfqWxaYG2b16kKlrMnPw",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS45RjNFMDhGQ0Q2RkFCQTc1",
      snippet: {
        publishedAt: "2020-11-11T23:19:07Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "36 Django tutorial | كورس دجانجو | اضافة سيمات جديدة للادمن بانل | Customise the Django admin",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\n________________________\nTo install Django Suit\n\nرابط تحميل Django Suit\nhttps://django-suit.readthedocs.io/en/v2/install.html\n________________________\n\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/SztX1oc19gY/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/SztX1oc19gY/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/SztX1oc19gY/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/SztX1oc19gY/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/SztX1oc19gY/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 35,
        resourceId: {
          kind: "youtube#video",
          videoId: "SztX1oc19gY",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "jlPT96L0wHIRC96IgU0wxNoQY6I",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS40QTA3NTU2RkM1QzlCMzYx",
      snippet: {
        publishedAt: "2020-11-11T23:19:40Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "37  Django tutorial | كورس دجانجو | اضافة سيمات جديدة للادمن بانل | Customise the Django admin",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/BGw585tHX8Y/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/BGw585tHX8Y/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/BGw585tHX8Y/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/BGw585tHX8Y/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/BGw585tHX8Y/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 36,
        resourceId: {
          kind: "youtube#video",
          videoId: "BGw585tHX8Y",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
    {
      kind: "youtube#playlistItem",
      etag: "PjOXtkJ7UCpzYAcYqtPj1cE-qj8",
      id: "UExrbndFbUtzVzhPdEtfbjQ4VU91WUd4SlBiU0ZySUN4bS5BRjJDODk5REM0NjkzMUIy",
      snippet: {
        publishedAt: "2020-11-11T23:29:20Z",
        channelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
        title:
          "38 Django tutorial | كورس دجانجو | اضافة فيوتشرز مهمة جدا ف الادمن بانل | Customise the Django admin",
        description:
          "What is Django\nهو اطار عمل عالي المستوي مكتوب بالبايثون مخصص لانشاء تطبيقات ويب بصورة سريعه وامنه جانغو يغطي الكثير من الاشياء بحيث يسمح لك بالتركيز علي بناء التطبيق الخاص بك فقط دون التشتت في اشياء اخري\n\n\n\nلتبدا مع جانقو\n\nيجب انيكون لديك خلفية في بعض الاشياء مثل\n\nhtml\ncss\njavaScript\nthe basic of python and oop concept\nاذا كان لديك خلفية في هذه الاشياء فا انت مستعد للبدايه اما اذا لم يكن لديك خلفية يجب ان تتعلمها لانها ستسهل عليك الطريق حقآ\n\nجانغو إطار عمل يحتوي على الاف المكتبات الجاهزة يسهل لك عملية بناء مواقع الويب تم بناءه بلغة python\n\nويعتمد على تقنية\n\nMTV\n\nModel Template View\n\nطبعا التقنية مشهورة بأسم\n\nMVC\n\nModel View Controller\n\n\nافضل 8 مميزات في إطار عمل Django .\n\n1- التوثيق الممتاز Documentaion\n\nمن أكثر الأسباب التي تساعدك علي تعلم أي إطار عمل ، وإطار دجانجو بصفة خاصة هي التوثيق Documentaion , التوثيق هو المرجع الأساسي لكل مبرمج الذي يأخذ منه ما ينقصه في بناء مشروعه ، سواء كان شرح لمكتبة برمجية معينة او كود برمجي لأداء مهمة \nيتمتع دجانجو منذ بدايته في عام 2005 حتي الآن بتوثيق متحدث باستمرار ويحتوي علي شرح كافي لجميع ألأدوات والمكتبات البرمجية التي يحتاجها المبرمج داخل إطار دجانجو ، مع الشرح لطرق الإستخدام والتنصيب\n\n2- لغة Python\n\nبايثون هي السبب والداعم الأساسي وراء استخدام Django ، بما انها من أقوي اللغات البرمجية علي الساحة والمستخدمة في كثير من التخصصات مثل استخدامها مع إطار Django في برمجة مشاريع الويب ، واستخدامها في الذكاء الإصطناعي وتحليل البيانات والمجالات الأخري \n3-SEO Optimization\nهذه من افضل المميزات التي تعطي Django أفضلية علي بعض أطر العمل الأخري المستخدمة في برمجة مواقع الويب SEO تعني Search Engine Optimization وتفيد بتهيئة الموقع وظهوره وترتيبه في محركات البحث ،في الغالب تستخدم محركات البحث خوارزميات معقدة يصعب فهمها علي المطورين \nولكن Django لديه العديد من المكتبات البرمجية التي تسهل هذا الأمر علي المطور وتساعده في ظهور وأرشفة الموقع لدي محركات البحث بشكل جيد\n\n4- القابلية والتوسع Scalability\n\nيستخدم إطار Django حول العالم المزيد من الشركات التي تقوم بتنفيذ مشاريعها من خلاله\nدون ظهور أي عيوب أو أخطاء من الناحية الفنية لإطار العمل وهذه نقطة تجعل دجانجو إطار عمل قابل للتوسع والتطوير علي نطاق واسع \nالقابلية والتوسع تعني تحديد النطاق والمستوي المتبع لتنفيذ التقنيات والخدمات علي إطار العمل\nعلي سبيل المثال اذا شاهدنا أحد الأمثلة علي المواقع العالمية التي تستخدم دجانجو مثل instgram ، الذي يمتلك ملايين المستخدمين والزوار ويقوم بتوليد كميات هائلة من البيانات يوميا \nهذا النوع من المواقع يعمل علي أنظمة وتقنيات عالية المستوي وفي منتهي الدقة\n\nدجانجو تم بناءه من الصفر علي ايدي مبرمجين محترفين وعلي قدر عالي من الخبرة ويخضع لآلاف العمليات من الإختبار والفحص مما يجعله بيئة عمل آمنة وموثوقة واختيار جيد لمطوري الويب .\n5- تعدد الجوانب والإستعمال Versatile\n\nدجانجو إطار عمل متعدد الجوانب ، البيئة المعمارية التي يعمل عليها هي MVT وتعني Model , Views , Templates , في بعض الأحيان تظن أن بيئة دجانجو المعمارية محدودة ولكن علي العكس لأنه بعد تزويدك بالملفات الأساسية للمشروع يمكنك بناء اي تطبيق ويب \nدجانجو إطار عمل يسمح بالتعامل مع جميع التقنيات الحديثة ، اذا كنت قادما من أي إطار عمل أخر يمكنك في وقت قصير فهم آلية العمل علي Django والبدء في تنفيذ مشاريعك من تطبيقات ومواقع الويب\n6- توفير الأمان العالي Heigh Securit\n\nدجانجو إطار عمل آمن للغاية ، وللتأكد من ذلك يمكننا الإطلاع علي المواقع العالمية التي تم بناءها عليه مثل Spotify او instgram , حيث تخضع هذه المواقع لعمليات فحص وتطوير موسعة وتحتاح ايضا الي بيئة عمل آمنة لاعتمادها في عمليات البناء والتطوير \nمما يجعل Django في مقدمة أطر العمل المستخدمة في بناء مشاريع ومواقع الويب العالمية والمشهورة\n7- الإختيار والدقة Thoroughly\n\nعندما نتعلم تقنية جديدة نريدها أن تكون قوية بشكل كافي لتحمل التغييرات الديناميكية التي تحدث باستمرار ، معظم الشركات العالمية التي تستخدم دجانجو في تنفيذ المشاريع البرمجية لديها تفيد بأنه يعمل بشكل جيد ويحقق ايضا المعايير الدولية .\n8- توفير التطور السريع Rapid Development\n\nعلي الرغم أن الكثير من التقنيات توفر هذه الميزة ، ولكن دجانجو ايضا يوفرها بشكل ممتاز\n\nتوفير التطوير السريع يعني اننا لن نحتاج الي خلفية متخصصة وشاملة في انتاج مشاريعنا من مواقع الويب ، لأن دجانجو بدوره يوفر لك بيئة عمل سهلة كمطور \nعلي سبيل المثال لن نقوم بإنشاء ملفات خادم منفصلة للاتصال بقاعدة البيانات لنقل البيانات من الخادم واليه ، ولكن كل ما عليك فعله ان تفهم آلية العمل وتوزيع المجلدات والملفات الأساسية للمشروع وعند الإنتهاء تدخل أوامر التنفيذ والإتصال وسيعمل التطبيق بشكل جيد دون مشاكل",
        thumbnails: {
          default: {
            url: "https://i.ytimg.com/vi/WBH8P0AxUrA/default.jpg",
            width: 120,
            height: 90,
          },
          medium: {
            url: "https://i.ytimg.com/vi/WBH8P0AxUrA/mqdefault.jpg",
            width: 320,
            height: 180,
          },
          high: {
            url: "https://i.ytimg.com/vi/WBH8P0AxUrA/hqdefault.jpg",
            width: 480,
            height: 360,
          },
          standard: {
            url: "https://i.ytimg.com/vi/WBH8P0AxUrA/sddefault.jpg",
            width: 640,
            height: 480,
          },
          maxres: {
            url: "https://i.ytimg.com/vi/WBH8P0AxUrA/maxresdefault.jpg",
            width: 1280,
            height: 720,
          },
        },
        channelTitle: "Abdelrahman Gamal",
        playlistId: "PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm",
        position: 37,
        resourceId: {
          kind: "youtube#video",
          videoId: "WBH8P0AxUrA",
        },
        videoOwnerChannelTitle: "Abdelrahman Gamal",
        videoOwnerChannelId: "UCbQh1yxBPVhyjB-G_blFFEQ",
      },
    },
  ],
  pageInfo: {
    totalResults: 38,
    resultsPerPage: 50,
  },
};


let htmlItems = htmlJson.items;
let htmlLength = htmlItems.length;
let toggle = document.querySelector(".toggle");
let btnList = document.querySelector(".btnList");

// toggle function
toggle.addEventListener("click", () => {
  if (btnList.style.display == "none") {
    btnList.setAttribute(
      "style",
      "display:block; position:fixed; top:55px; width:50%;"
    );
  } else {
    btnList.setAttribute("style", "display:none");
  }
});

for (let i = 0; i < htmlLength; i++) {
  let lessonBtn = document.createElement("button");
  let btnText = document.createTextNode(`Lesson ${i + 1}`);
  lessonBtn.classList.add("lessonBtn");
  lessonBtn.appendChild(btnText);
  btnList.appendChild(lessonBtn);
}
let lessonBtn = document.querySelectorAll(".lessonBtn");
for (let i = 0; i < htmlLength; i++) {
  lessonBtn[i].addEventListener("click", () => {
    document.getElementById(
      "videoFrame"
    ).src = `https://www.youtube.com/embed/${htmlItems[i].snippet.resourceId.videoId}?list=PLknwEmKsW8OtK_n48UOuYGxJPbSFrICxm`;
  });
}
